## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@terrateam-362405.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_project_service.enabled_apis["gkehub.googleapis.com"] will be created
+   resource "google_project_service" "enabled_apis" {
+       disable_on_destroy = false
+       id                 = (known after apply)
+       project            = "terrateam-362405"
+       service            = "gkehub.googleapis.com"
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/b139b9f55c27f4adf24a3c8d3cac4a60ec807059" -> (known after apply)
!       name               = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/b139b9f55c27f4adf24a3c8d3cac4a60ec807059" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJWVBKVkZpSENvTmN3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTJOemd6TkRRM09EWXdOamd4TURFeU56VTNNQ0FYRFRJeU1Ea3hPREExTXpFd04xb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EWTNPRE0wTkRjNE5qQTJPREV3TVRJM05UY3dnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ3hiTGRaNjhZN0orVXlhTVdYNEJKdFRjTGIKbDlKQk52OFlTRnQxZlcxdUNxb29PVitUS0tLdU52Tlh6NGtudzI4UDkzdnVHL05tUkltQnYrQXhHcENON2JwdQpocCs1UDlDT3R0eXJnb0h0Y2thbDloQ05pdXJKTE9sclhLdU9KZ2Vqc0gxMEErUTJadjZYVFBPUWVkWS8rbUEwCjNjUTFtUSt5VWJVWGFkNlJxMGVSWHJzRzlWUjIwQlhZeHpYVGpqanhyaGZLZ0hPNEZMMVlha0FuaEZpbGJKNkoKQTVkdmJXR2FRU2htbkRtcitVNjlxZXlYSys0Nm1ZbnlnNkJDRzBlVG1WMFFBQkRNWEdlMDBkUU5YMURza0c4Wgp2OERHNkJjZjR2eExyTnU2VzdIVmx5eXFJK20vSXlGSlNIQWlGOW1jU3hrWDVKeDVaTlVyeVc0aGNtWWRBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQUNDdXBENVl6NVNoZ1pLb1gzb1J5bgpKQ2tmZG5ZMFY0VGFXTThtQnZsV2lTQ1hmOVhOUUxFUzdqQ0ViUHVrVWRzSFJ0b3VlOVVPSlo0dHp3Q0JUT1NUCkh4bDJ0Y2FkNWF6b2RadUJadjREMTRWZXRVQzArVHRlVVRCZjVhNW1ka0hsS09Scm9HS1BhZEdhV0o2ZEdGN3gKNm5RZkE2U3NCSEpSQy9IR0dXT0Q0STYvUnZrWmlycnFEckJRZnB4bVlkUFFrYlJ4blZHcUx3azVuazllQ2o0awp6UzJBQVBjck16NXoxaE9QMEZWdU1NQzZIRWFqVkMzMnFkZ1JqNDZLOXQ2MlJ5TDQwc2cwY1luRE8xYWZ4NWl5ClZlK1p5VWZvYjgxNEkwR3VPTlhBY3dyTEtGd1RmNmpXYUM1T0dETzZWV3FpbDNzK1krWi9GMDF1b0o4U0dXNFkKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-18T05:31:07Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # null_resource.cluster1_hub_mesh_update is tainted, so must be replaced
-/+ resource "null_resource" "cluster1_hub_mesh_update" {
!       id       = "3419465048996061457" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.asm.google_gke_hub_membership.membership[0] will be created
+   resource "google_gke_hub_membership" "membership" {
+       id            = (known after apply)
+       membership_id = "cinema-membership"
+       name          = (known after apply)
+       project       = "terrateam-362405"

+       endpoint {
+           gke_cluster {
+               resource_link = "//container.googleapis.com/projects/terrateam-362405/locations/us-central1/clusters/cinema"
            }
        }
    }

  # module.gke-cinema.data.google_compute_zones.available will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
+       id      = (known after apply)
+       names   = (known after apply)
+       project = "terrateam-362405"
+       region  = "us-central1"
    }

  # module.gke-cinema.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1"
+       project                         = "terrateam-362405"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.data.google_container_engine_versions.zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "zone" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1-a"
+       project                         = "terrateam-362405"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.google_container_cluster.primary will be updated in-place
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema"
!       min_master_version          = "1.24.3-gke.2100" -> (known after apply)
        name                        = "cinema"
        # (26 unchanged attributes hidden)

        # (20 unchanged blocks hidden)
    }

  # module.gke-cinema.random_shuffle.available_zones must be replaced
-/+ resource "random_shuffle" "available_zones" {
!       id           = "-" -> (known after apply)
!       input        = [
-           "us-central1-a",
-           "us-central1-b",
-           "us-central1-c",
-           "us-central1-f",
        ] -> (known after apply) # forces replacement
!       result       = [
-           "us-central1-b",
-           "us-central1-a",
-           "us-central1-c",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] is tainted, so must be replaced
-/+ resource "null_resource" "run_command" {
!       id       = "7936229266866667527" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 2 to change, 4 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
